"""
随机森林算法
Contributor：zhouyushun
Reviewer：xionglongfei
主要利用用户的数据特征，预测是否相亲成功
输入：用户的数据特征
输出：是否相亲成功，0,1
"""


from sklearn.ensemble import RandomForestClassifier


#学历分类：{大专：[1,0,0],本科:[0,1,0],硕士:[0,0,1]}
#'年龄','身高','年收入','学历'
X = [[25,179,15,1,0,0],
     [33,190,19,1,0,0],
     [28,180,18,0,0,1],
     [25,178,18,0,0,1],
     [46,177,100,0,0,1],
     [40,170,70,0,1,0],
     [34,174,20,0,0,1],
     [36,181,55,0,1,0],
     [35,170,25,0,0,1],
     [30,180,35,0,1,0],
     [28,174,30,0,1,0],
     [29,176,36,0,1,0]]

#有否相亲 0:N 1:Y
y = [0,1,1,1,0,0,1,0,1,1,0,1]

#现在把训练数据和对应的分类放入分类器中进行训练
rf_clf = RandomForestClassifier().fit(X,y)

#预测下面此人是否相亲
p = [[28,180,18,0,0,1]]

res = rf_clf.predict(p)

print(res)
