"""
SVM算法
Contributor：zhouyushun
Reviewer：xionglongfei
主要利用用户的数据特征，预测是否相亲成功
输入：用户的数据特征
输出：是否相亲成功，0,1
"""


from sklearn import svm


#婚姻状况：{已婚：[1,0,],未婚:[0,1]}
#'年龄','年收入','婚姻状况',
X = [[26,15,1,0],
     [34,19,1,0],
     [29,18,0,1],
     [24,18,0,1],
     [48,100,0,1],
     [45,70,1,0],
     [33,20,0,1],
     [27,55,0,1],
     [38,25,1,0],
     [40,35,0,1],
     [48,30,1,0],
     [22,36,0,1]]

#有否相亲 0:N 1:Y
y = [0,1,1,1,0,0,1,0,1,1,0,1]

#现在把训练数据和对应的分类放入分类器中进行训练
svm_clf = svm.SVC(kernel='rbf').fit(X,y)

#预测下面此人是否相亲
p = [[28,20,0,1]]

res = svm_clf.predict(p)

print(res)
